Tekla.Structures.TeklaStructuresInternal.MateriaClient.MateriaGraph
The class implementation for IGraph.

Tekla.Structures.TeklaStructuresInternal.MateriaClient.MateriaGraph.Asset


Tekla.Structures.TeklaStructuresInternal.MateriaClient.MateriaGraph.GraphComputed


Tekla.Structures.TeklaStructuresInternal.MateriaClient.MateriaGraph.Dispose
Dispose resources

Tekla.Structures.TeklaStructuresInternal.MateriaClient.MateriaGraph.Dispose(System.Boolean)
Clean up
disposing:

Tekla.Structures.TeklaStructuresInternal.MateriaClient.MateriaGraph.CreateGraph(Tekla.Structures.TeklaStructuresInternal.MateriaClient.Asset,Tekla.Structures.TeklaStructuresInternal.MateriaClient.ComputedCallbackHandler)
Creates the graph instance.
asset: The asset
graphComputedCallbackHandler: The graph computed callback handler
Returns:

Tekla.Structures.TeklaStructuresInternal.MateriaClient.MateriaGraph.CreateGraph(Tekla.Structures.TeklaStructuresInternal.MateriaClient.Asset,System.Collections.Generic.List{Tekla.Structures.TeklaStructuresInternal.MateriaClient.GraphParameter},Tekla.Structures.TeklaStructuresInternal.MateriaClient.ComputedCallbackHandler)
Creates the graph instance with the graph parameters.
asset: The asset
graphParameters: The graph parameters
graphComputedCallbackHandler: The graph computed callback handler
Returns:

Tekla.Structures.TeklaStructuresInternal.MateriaClient.MateriaGraph.GetParameterList


Tekla.Structures.TeklaStructuresInternal.MateriaClient.MateriaGraph.SetParameterList(System.Collections.Generic.List{Tekla.Structures.TeklaStructuresInternal.MateriaClient.GraphParameter})


Tekla.Structures.TeklaStructuresInternal.MateriaClient.MateriaGraph.GetTrimBimToFile(System.String)


Tekla.Structures.TeklaStructuresInternal.MateriaClient.MateriaGraph.ToString
